{
  "home": "Home",
  "courses": "Courses",
  "online": "Online",
  "offline": "Offline",
  "oneOnOne": "One-on-one",
  "group": "Group study",
  "teachers": "Teachers",
  "aboutUs": "About Us",
  "newsPage": "News",
  "support": "Support 24/7",
  "contactEmail": "Contact Email",
  "loginPage": "Login",
  "tryForFree": "Book Free Demo Class!",
  "menu": "Menu",
  "students": "Students",

  "teachingHours": "teaching hours",

  "footer.intro": "At Sam’s English School, we are committed to providing a unique and inspiring learning experience. With personalized teaching methods and a dedicated team of instructors, we empower learners to grow with confidence. Join us on a journey of positive transformation — where you don’t just learn English, but also discover your true potential in a dynamic and supportive environment.",
  "footer.linksTitle": "Links",
  "footer.courseTitle": "Course",
  "footer.contactTitle": "Contact",
  "footer.course1": "IELTS Preparation",
  "footer.course2": "English for CEOs and Directors",
  "footer.course3": "Cambridge Program",
  "footer.course4": "Communication Skills",
  "footer.course5": "Corporate training",

  "registerNow": "REGISTER NOW",
  "seeMore": "SEE MORE",
  "viewAll": "View All",

  "home.Headline1": "Learning Experience",
  "home.Headline2": "Online",
  "home.Headline3": "and",
  "home.Headline4": "Offline",
  "home.Headline5": "for all ages",
  "home.Subtext1": "Explore thousands of fun and interactive activities",
  "home.Subtext2": "to support your child's learning and development.",

  "home.point1": "Flexible",
  "home.point2": "Learning path",
  "home.point3": "Community",

  "home.whyChoose1": "Why Choose",
  "home.whyChoose2": "Sam's English School",
  "home.choose.teacher": "Native\nTeachers",
  "home.choose.teacher.desc": "Our 100% native teachers from the US, UK, and Australia have many years of experience.",
  "home.choose.program": "Diverse\nPrograms",
  "home.choose.program.desc": "From IELTS prep, conversation, business English to 1-on-1 classes.",
  "home.choose.method": "Creative Learning Methods",
  "home.choose.method.desc": "Learn through play! Interactive and hands-on methods applied via Zoom.",
  "home.document.title1": "Our learning materials are engaging and exciting for ",
  "home.document.title2": "children",
  "home.document.subtext": "We design colorful, lively, and easy-to-understand curricula specifically for kids. Each lesson blends games, visuals, and interactive activities so your child learns naturally and never gets bored.",
  "home.vision1": "We aim to help students discover the",
  "home.vision2": "the joy of learning,",
  "home.vision3": "grow creatively, and become well-rounded individuals.",
  "home.ourCourses1": "Our",
  "home.ourCourses2": "Courses",
  "home.ourClients1": "Our",
  "home.ourClients2": "Clients",
  "home.faq.title1": "Frequently",
  "home.faq.title2": "Asked",
  "home.faq.title3": "Questions",

  "programs.teacherTitle.span": "Our",
  "programs.teacherTitle.rest": "teacher",
  "programs.benefitTitle1": "What will you get",
  "programs.benefitTitle2": "after studying at",
  "programs.benefitTitle3": "Sam English School?",
  "programs.benefit1": "Confidently communicate in English every day",
  "programs.benefit2": "Comprehensive development of 4 skills",
  "programs.benefit3": "Quick English reflex thinking",

  "banner.title.line1": "Sam invites you to experience",
  "banner.title.line2": "a free demo class",

  "banner.dateRange": "Promotion valid from {{startDate}} - {{endDate}}",
  "banner.cta": "Explore now",

  "filter.genre.all": "All",
  "filter.genre.online": "Online",
  "filter.genre.offline": "Offline",
  "filter.genre.oneOnOne": "1 on 1",
  "filter.genre.group": "Group",
  "filter.sort.latest": "Nearest",
  "filter.sort.popular": "Popular",
  "filter.sortBy": "Sort by",
  "filter.searchPlaceholder": "Search Course, Teacher Name",

  "consultation.title": "Free Consultation",
  "consultation.submit": "Send request",
  "consultation.placeholder.name": "Full name",
  "consultation.placeholder.phone": "Phone number",
  "consultation.placeholder.email": "Email account",
  "consultation.placeholder.message": "Content needing support",

  "teachers.title": "Our Teachers",

  "intro.heading1": "We are a community of changemakers",
  "intro.heading2": "we educate, we inspire, we empower",
  "intro.subheading": "Discover the passion and expertise behind Sam's English School, where we are committed to providing exceptional English language education and building a supportive learning environment for students around the world.",
  "intro.founderTitle": "Sam Mittal - Founder & Teacher at Sam's English School",
  "intro.founderRole": "Founder and CEO",
  "intro.founderBio1": "My name is Sam Mital, and I am passionate about education and language learning. With over 10 years of teaching experience, I have had the privilege of working in 15 different countries and teaching at many universities. As a former IELTS examiner, I have seen first-hand the transformative power of language education.",
  "intro.founderBio2": "I founded Sam's English School to make a positive impact on people's lives through language learning. Our mission is to open up new possibilities for personal and professional growth by mastering English. We believe that learning a new language can open doors to a world of opportunities and enrich lives in meaningful ways.",
  "intro.founderBio3": "At Sam's English School, we are committed to making a difference. We invite you to join us our community and start your journey of positive change and growth. Together, we can make a significant impact on your life and career.",
  "intro.founderBio4": "Join us and experience the positive transformation that language learning can bring.",
  "intro.missionTitle1": "Mission of",
  "intro.missionTitle2": "Sam's English School",
  "intro.missionDescription": "At Sam's English School, we believe that every student can become the best version of themselves through a quality and inspiring English learning environment. We do not just teach language, but also develop confidence, critical thinking and communication skills for students of all ages. With a dedicated team of native teachers and a personalized teaching method, Sam's is committed to accompanying students on a solid and inspiring journey to conquer English.",
  "intro.visionTitle": "Our Vision",
  "intro.visionDescription1": "At Sam's English School, we aim to build a generation of students who are confident, capable and ready to integrate globally through their ability to use English fluently.",
  "intro.visionDescription2": "We constantly innovate teaching methods, creating a positive, modern and inspiring learning environment, helping students develop comprehensively in language, thinking and soft skills.",
  "intro.visionDescription3": "Our vision is to become a leading English center, where every student is given the opportunity to reach out and shine on their learning and life journey.",
  "intro.whyTitle": "Why Choose Sam's English School",
  "intro.why": {
    "0": {
      "title": "Experienced teachers",
      "desc": "A team of teachers from English-speaking countries, highly specialized and dedicated, helping students develop comprehensive language skills."
    },
    "1": {
      "title": "Modern learning methods",
      "desc": "Applying advanced teaching methods, focusing on practice and interaction, helping students learn quickly, remember for a long time, and naturally."
    },
    "2": {
      "title": "Reasonable cost, quality",
      "desc": "We offer high-quality learning programs with reasonable tuition fees, ensuring effectiveness and value for each course."
    }
  },
  "news": {
    "title": "News",
    "latest": "Latest articles",
    "seeAll": "See all",
    "articles": {
      "0": {
        "title": "British teacher teaches children in the highlands, loves Vietnam for its kindness",
        "content": "During his time in Vietnam, Sam Mittal (37 years old, British nationality) spent time going to the highlands, teaching English to the people because he wanted to help them change their lives.",
        "source": "Dan Tri Newspaper"
      },
      "1": {
        "title": "Foreigners volunteering in Vietnam",
        "content": "A few months after graduating from high school, Mara carried her suitcase alone and flew from Berlin to Ho Chi Minh City to start a year of volunteering. She found a job teaching English for free at a center in Binh Thanh district through the Worldpacker application.",
        "source": "VN Newspaper Express"
      },
      "2": {
        "title": "Digital nomads flock to Vietnam",
        "content": "At a Mui Ne coffee shop, Sam turns on his laptop to teach English to 4 students. The 33-year-old British man has been to 51 countries, came to Vietnam 4 years ago and rode a motorbike from Ca Mau to Ha Giang.",
        "source": "VN Express Newspaper"
      },
      "3": {
        "title": "Funny and Tragic: Western Tourist Learns to Survive the Blazing Heat of Ho Chi Minh City – Practicing... Napping and Drinking Sugarcane Juice",
        "content": "Zach (30 years old) is an American who has been living in Ho Chi Minh City for 9 months. He works as an English teacher at language centers and secondary schools. Zach jokingly said that he has been 'fighting' against the extreme heat during the peak of the hot season.",
        "source": "General News and Information Portal"
      }
    },
    "trending": {
      "title": "Trending News",
      "readNow": "Read Now",
      "alt": "Trending News",
      "headline": "Foreigners Who Choose Ho Chi Minh City as Their Home",
      "paragraph1": "Like Jay, Sam – 34 years old, from the UK – shared that although he has traveled to 65 countries, he still chose to live in Ho Chi Minh City and considers it his home. Sam was deeply impressed by Vietnam during a cross-country motorbike trip with five friends. He recounted a rainy afternoon in Cai Be (Tien Giang), when the group stood in front of a small house with baskets of fruit on a bench at the door—presumably for sale to passersby. Soaked, hungry, and cold, Sam asked to buy some fruit to stave off hunger.",
      "paragraph2": "Sam chose to live in Ho Chi Minh City because it’s easy to find an apartment, European food, or Western-style restaurants here. The cost of living is also much lower compared to the UK. For instance, renting a two-bedroom apartment in the UK costs about $3,000/month, while in HCMC, he only pays around 12–15 million VND (roughly $500) for a fully equipped two-bedroom apartment with a swimming pool.",
      "paragraph3": "Not knowing Vietnamese, he had to use hand gestures to communicate with the three people in the house. They warmly offered the fruit to the whole group. Sam shared: “When I tried to pay, they refused, signaling not to worry. They just wanted to give, expecting nothing in return, even though they looked very poor. Their kindness and warmth really touched me. That’s also why I came back to Vietnam.”",
      "paragraph4": "Sam’s main job now is teaching English, mostly online. With a flexible schedule, he can work from anywhere, which allows him to always be on the move. He and a few friends have traveled through all the provinces and cities in Vietnam, then returned to HCMC like coming back home.",
      "paragraph5": "After six years here, there are still things Sam dislikes—for example, many people sing karaoke all night.",
      "source": "Phu Nu Newspaper"
    },
    "videos": {
      "main": {
        "url": "https://www.youtube.com/embed/yjnPq65n0l8?si=Xj0hVixhEqjKTYvh",
        "link": "https://youtu.be/yjnPq65n0l8?si=7A3fVLpNc2kYZL47",
        "title": "Foreigners are crazy about Vietnam's unique vegetarian food",
        "desc": "Amazing Vietnamese Foods is a series about the reactions of foreigners when trying the unique dishes of Vietnamese cuisine. With the participation of diners from all over the world, it promises to bring funny, dramatic and surprising reactions..."
      },
      "small": [
        {
          "url": "https://www.youtube.com/embed/le21na5iGjQ?si=evOHGv090mdvPWKV",
          "title": "Foreigners can only laugh haha ​​when eating Vietnamese fruit for the first time",
          "desc": "Tourists try durian, jackfruit, rambutan for the first time... and have funny reactions. The video is funny but also promotes Vietnamese tropical fruits."
        },
        {
          "url": "https://www.youtube.com/embed/Zc_DvR_1V40?si=WFZuevFi875GYaL-",
          "title": "NORTHWEST SPECIALTIES make foreigners excited for STORM POINT 10",
          "desc": "Foreign diners eat balut for the first time - a dish that is 'both strange and scary' in their eyes. Unexpected and adorable reactions."
        },
        {
          "url": "https://www.youtube.com/embed/rKxdxBuOfRs?si=ALlahWyMddFX2oIw",
          "title": "Vietnamese vermicelli dishes that make 3 Westerners slurp up not a single drop",
          "desc": "Banh trang tron ​​- a legendary snack brought to foreign guests to try for the first time. The sour, spicy, salty and sweet taste makes many people immediately fall in love."
        }
      ]
    }
  },
  "teacher": {
    "totalCourse": "Number of courses",
    "ratings": "Ratings",
    "experiences": "Experience",
    "graduated": "Degree",
    "language": "Language",
    "social": "Social Network",
    "bookLesson": "Book a Lesson",
    "about": "About",
    "certification": "Certificate",
    "courses": "Courses"
  },
  "classImage": {
    "heading": "Classroom Image",
    "description": "Native teachers Nationality: UK, USA, Australia, Canada, New Zealand, South Africa, … Teachers with extensive experience in teaching English, capable of teaching many age groups and creative in their teaching methods."
  },
  "programDetail": {
    "totalLessons": "Number of lessons",
    "lessonUnit": "lessons",
    "duration": "Completion time",
    "studentsLearned": "Students learned",
    "rating": "Rating",
    "register": "Register to study",
    "tryFree": "Try Free",
    "courseDetail": "Course Details",
    "certification": "Certification",
    "target": "Relevant for",
    "learningOutcomes": "You will learn:",
    "similarCourses": "Similar courses",
    "viewAll": "View all",
    "testimonials": "Students' testimonials",
    "testimonialDesc": "A team of native teachers from the UK, US, Australia, Canada, New Zealand, South Africa... with rich teaching experience, creativity and suitable for many ages."
  },
  "login": {
    "title": "Welcome back 👋",
    "description": "Today is a new day. Please log in to start managing your documents.",
    "email": "Email",
    "emailPlaceholder": "Enter your email",
    "password": "Password",
    "passwordPlaceholder": "Enter your password",
    "loginBtn": "Log in",
    "error": "Incorrect email or password. Please try again."
  },
  "courseitem": {
    "enrolled": "Students enrolled",
    "classesTaken": "Classes enrolled",
    "joinNow": "Join Now"
  },
  "teacheritem": {
    "students": "Students",
    "bookLesson": "Book a lesson",
    "contactNow": "Contact now"
  },
  "notFound": {
    "title": "Page not found",
    "description": "Sorry, we couldn’t find the page you’re looking for.",
    "backHome": "Go back home",
    "contact": "Contact support"
  }
}
